In [1]:
import pandas as pd
import numpy as np
import mysql.connector

**CUSTOMER DATA**

In [2]:
customer_data =pd.read_csv("F:/PROJECT/MINI PROJ 2/DataSet/Customers.csv", encoding = 'latin1')

In [3]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [4]:
customer_data.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [5]:
customer_data['Birthday'] = pd.to_datetime(customer_data['Birthday'], format="%m/%d/%Y", errors='coerce').dt.date

In [6]:
customer_data

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,1936-03-25
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,1992-02-16
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,1937-11-09
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,1937-10-12
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,1965-08-18

In [7]:
customer_data.dropna(inplace=True)

In [8]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15256 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15256 non-null  int64
 1   Gender       15256 non-null  object
 2   Name         15256 non-null  object
 3   City         15256 non-null  object
 4   State Code   15256 non-null  object
 5   State        15256 non-null  object
 6   Zip Code     15256 non-null  object
 7   Country      15256 non-null  object
 8   Continent    15256 non-null  object
 9   Birthday     15256 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.3+ MB

**PRODUCT DATA**

In [9]:
products_data = pd.read_csv("F:/PROJECT/MINI PROJ 2/DataSet/Products.csv")

In [10]:
products_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [11]:
products_data["Unit Cost USD"] = products_data["Unit Cost USD"].str.replace("$", "").str.replace(",", "")
products_data["Unit Cost USD"] = products_data["Unit Cost USD"].astype(float)

products_data["Unit Price USD"] = products_data["Unit Price USD"].str.replace("$", "").str.replace(",", "")
products_data["Unit Price USD"] = products_data["Unit Price USD"].astype(float)

**SALES DATA**

In [12]:
sales_data = pd.read_csv('F:/PROJECT/MINI PROJ 2/DataSet/Sales.csv')

In [13]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [14]:
sales_data.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [15]:
sales_data['Order Date'] = pd.to_datetime(sales_data['Order Date'], format="%m/%d/%Y", errors='coerce').dt.date

In [16]:
sales_data.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaN,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1/13/2016,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1/13/2016,1269051,0,2007,1,USD
3,366002,1,2016-01-01,1/12/2016,266019,0,1106,7,CAD
4,366002,2,2016-01-01,1/12/2016,266019,0,373,1,CAD

In [17]:
sales_data.drop("Delivery Date", axis=1, inplace=True)

In [18]:
stores_data = pd.read_csv("F:/PROJECT/MINI PROJ 2/DataSet/Stores.csv")

In [19]:
stores_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [20]:
stores_data.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [21]:
stores_data['Open Date'] = pd.to_datetime(stores_data['Open Date'], format="%m/%d/%Y", errors='coerce').dt.date

In [22]:
stores_data["Square Meters"]=stores_data["Square Meters"].fillna(0)

**EXCHANGE RATES DATA**

In [23]:
exchange_rates_data = pd.read_csv('F:/PROJECT/MINI PROJ 2/DataSet/Exchange_Rates.csv')

In [24]:
exchange_rates_data['Date'] = pd.to_datetime(exchange_rates_data['Date'], format="%m/%d/%Y", errors='coerce').dt.date

In [25]:
exchange_rates_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [26]:
exchange_rates_data.rename(columns={"Currency":"Currency Code"},inplace =True)

In [27]:
exchange_rates_data.head()

         Date Currency Code  Exchange
0  2015-01-01           USD    1.0000
1  2015-01-01           CAD    1.1583
2  2015-01-01           AUD    1.2214
3  2015-01-01           EUR    0.8237
4  2015-01-01           GBP    0.6415

In [28]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15256 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15256 non-null  int64
 1   Gender       15256 non-null  object
 2   Name         15256 non-null  object
 3   City         15256 non-null  object
 4   State Code   15256 non-null  object
 5   State        15256 non-null  object
 6   Zip Code     15256 non-null  object
 7   Country      15256 non-null  object
 8   Continent    15256 non-null  object
 9   Birthday     15256 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.3+ MB

In [29]:
products_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [30]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: int64(6), object(2)
memory usage: 3.8+ MB

In [31]:
stores_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [32]:
exchange_rates_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           11215 non-null  object
 1   Currency Code  11215 non-null  object
 2   Exchange       11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

**CONNECT TO SQL FOR STORING THE DATA**

In [34]:
#sql connection
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="2312",
    database="global_electronics")
my_cursor = conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS global_electronics")
print("database created successfully")

database created successfully

**CREATE TABLE FOR CUSTOMER DATA**

In [35]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS customer_data(
                  CustomerKey INT,
                  Gender VARCHAR(255),
                  Name VARCHAR(255),
                  City VARCHAR(255),
                  State_Code VARCHAR(255),
                  State VARCHAR(255),
                  Zip_Code VARCHAR(255),
                  Country VARCHAR(255),
                  Continent VARCHAR(255),
                  Birthday DATE
                  )''')
print("Table Created successfully")

Table Created successfully

In [36]:
# insert values into customer table
insert_query='''INSERT INTO customer_data(
                  CustomerKey,
                  Gender,
                  Name,
                  City,
                  State_Code,
                  State,
                  Zip_Code,
                  Country,
                  Continent,
                  Birthday)
                  VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)'''

data = customer_data.values.tolist()
my_cursor.executemany(insert_query,data)

# Commit the transaction
conn.commit()
print("Inserted successfully")

Inserted successfully

**CREATE TABLE FOR PRODUCT DATA**

In [39]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS product_data(
                  ProductKey INT,
                  Product_Name VARCHAR(255),
                  Brand VARCHAR(255),
                  Color VARCHAR(255),
                  Unit_Cost_USD FLOAT,
                  Unit_Price_USD FLOAT,
                  Subcategorykey int,
                  Subcategory VARCHAR(255),
                  CategoryKey VARCHAR(255),
                  Category VARCHAR(255)
                  )''')
print("Table Created successfully")

Table Created successfully

In [40]:
#insert values into Products table
insert_query ='''INSERT INTO product_data(
                  ProductKey,
                  Product_Name,
                  Brand,
                  Color,
                  Unit_Cost_USD,
                  Unit_Price_USD,
                  Subcategorykey,
                  Subcategory,
                  CategoryKey,
                  Category)
                  VALUES (%s, %s, %s, %s, %s, %s, %s, %s,%s,%s)'''
data = products_data.values.tolist()
my_cursor.executemany(insert_query,data)
print("Inserted successfully")

Inserted successfully

**CREATE TABLE FOR SALES DATA**

In [41]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS sales_data(
                  Order_Number INT,
                  Line_Item INT,
                  Order_Date DATE,
                  CustomerKey INT,
                  StoreKey INT,
                  ProductKey INT,
                  Quantity INT,
                  Currency_Code VARCHAR(255)
                  )''')
print("Table Created successfully")

Table Created successfully

In [42]:
#insert values into sales table
insert_query ='''INSERT INTO sales_data(
                  Order_Number,
                  Line_Item,
                  Order_Date,
                  CustomerKey,
                  StoreKey,
                  ProductKey,
                  Quantity,
                  Currency_Code)
                  VALUES (%s, %s, %s, %s, %s, %s, %s,%s)'''
data = sales_data.values.tolist()
my_cursor.executemany(insert_query,data)
# Commit the transaction
conn.commit()
print("Inserted successfully")

Inserted successfully

**CREATE TABLE FOR STORES DATA**

In [54]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS stores_data(
                  StoreKey INT,
                  Country VARCHAR(255),
                  State VARCHAR(255),
                  Square_Meters FLOAT,
                  Open_Date DATE
                  )''')
print("Table Created successfully")

Table Created successfully

In [55]:
#insert values into Store table
insert_query ='''INSERT INTO stores_data(
                  StoreKey,
                  Country,
                  State,
                  Square_Meters,
                  Open_Date)
                  VALUES (%s, %s, %s, %s, %s)'''
data = stores_data.values.tolist()
my_cursor.executemany(insert_query,data)
print("Inserted successfully")

Inserted successfully

**CREATE TABLE FOR EXCHANGE RATES DATA**

In [49]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS exchange_rates_data(
                  Date DATE,
                  Currency_Code VARCHAR(255),
                  Exchange FLOAT
                  )''')
print("Table Created successfully")

Table Created successfully

In [51]:
# insert values into exchange table
insert_query ='''INSERT INTO exchange_rates_data(
                  Date,
                  Currency_Code,
                  Exchange)
                  VALUES (%s, %s, %s)'''
data = exchange_rates_data.values.tolist()
my_cursor.executemany(insert_query,data)

# Commit the transaction
conn.commit()
print("Inserted successfully")

Inserted successfully